leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN25 */
#define IFX_FLASH_ACCEN0_EN25_OFF (25u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN26 */
#define IFX_FLASH_ACCEN0_EN26_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN26 */
#define IFX_FLASH_ACCEN0_EN26_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN26 */
#define IFX_FLASH_ACCEN0_EN26_OFF (26u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN27 */
#define IFX_FLASH_ACCEN0_EN27_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN27 */
#define IFX_FLASH_ACCEN0_EN27_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN27 */
#define IFX_FLASH_ACCEN0_EN27_OFF (27u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN28 */
#define IFX_FLASH_ACCEN0_EN28_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN28 */
#define IFX_FLASH_ACCEN0_EN28_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN28 */
#define IFX_FLASH_ACCEN0_EN28_OFF (28u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN29 */
#define IFX_FLASH_ACCEN0_EN29_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN29 */
#define IFX_FLASH_ACCEN0_EN29_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN29 */
#define IFX_FLASH_ACCEN0_EN29_OFF (29u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN2 */
#define IFX_FLASH_ACCEN0_EN2_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN2 */
#define IFX_FLASH_ACCEN0_EN2_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN2 */
#define IFX_FLASH_ACCEN0_EN2_OFF (2u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN30 */
#define IFX_FLASH_ACCEN0_EN30_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN30 */
#define IFX_FLASH_ACCEN0_EN30_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN30 */
#define IFX_FLASH_ACCEN0_EN30_OFF (30u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN31 */
#define IFX_FLASH_ACCEN0_EN31_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN31 */
#define IFX_FLASH_ACCEN0_EN31_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN31 */
#define IFX_FLASH_ACCEN0_EN31_OFF (31u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN3 */
#define IFX_FLASH_ACCEN0_EN3_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN3 */
#define IFX_FLASH_ACCEN0_EN3_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN3 */
#define IFX_FLASH_ACCEN0_EN3_OFF (3u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN4 */
#define IFX_FLASH_ACCEN0_EN4_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN4 */
#define IFX_FLASH_ACCEN0_EN4_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN4 */
#define IFX_FLASH_ACCEN0_EN4_OFF (4u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN5 */
#define IFX_FLASH_ACCEN0_EN5_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN5 */
#define IFX_FLASH_ACCEN0_EN5_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN5 */
#define IFX_FLASH_ACCEN0_EN5_OFF (5u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN6 */
#define IFX_FLASH_ACCEN0_EN6_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN6 */
#define IFX_FLASH_ACCEN0_EN6_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN6 */
#define IFX_FLASH_ACCEN0_EN6_OFF (6u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN7 */
#define IFX_FLASH_ACCEN0_EN7_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN7 */
#define IFX_FLASH_ACCEN0_EN7_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN7 */
#define IFX_FLASH_ACCEN0_EN7_OFF (7u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN8 */
#define IFX_FLASH_ACCEN0_EN8_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN8 */
#define IFX_FLASH_ACCEN0_EN8_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN8 */
#define IFX_FLASH_ACCEN0_EN8_OFF (8u)

/** \brief  Length for Ifx_FLASH_ACCEN0_Bits.EN9 */
#define IFX_FLASH_ACCEN0_EN9_LEN (1u)

/** \brief  Mask for Ifx_FLASH_ACCEN0_Bits.EN9 */
#define IFX_FLASH_ACCEN0_EN9_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_ACCEN0_Bits.EN9 */
#define IFX_FLASH_ACCEN0_EN9_OFF (9u)

/** \brief  Length for Ifx_FLASH_CBAB_CFG_Bits.CLR */
#define IFX_FLASH_CBAB_CFG_CLR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_CFG_Bits.CLR */
#define IFX_FLASH_CBAB_CFG_CLR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_CFG_Bits.CLR */
#define IFX_FLASH_CBAB_CFG_CLR_OFF (8u)

/** \brief  Length for Ifx_FLASH_CBAB_CFG_Bits.DIS */
#define IFX_FLASH_CBAB_CFG_DIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_CFG_Bits.DIS */
#define IFX_FLASH_CBAB_CFG_DIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_CFG_Bits.DIS */
#define IFX_FLASH_CBAB_CFG_DIS_OFF (9u)

/** \brief  Length for Ifx_FLASH_CBAB_CFG_Bits.SEL */
#define IFX_FLASH_CBAB_CFG_SEL_LEN (6u)

/** \brief  Mask for Ifx_FLASH_CBAB_CFG_Bits.SEL */
#define IFX_FLASH_CBAB_CFG_SEL_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_CBAB_CFG_Bits.SEL */
#define IFX_FLASH_CBAB_CFG_SEL_OFF (0u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_CBAB_STAT_VLD0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_CBAB_STAT_VLD0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD0 */
#define IFX_FLASH_CBAB_STAT_VLD0_OFF (0u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD1 */
#define IFX_FLASH_CBAB_STAT_VLD1_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD1 */
#define IFX_FLASH_CBAB_STAT_VLD1_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD1 */
#define IFX_FLASH_CBAB_STAT_VLD1_OFF (1u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD2 */
#define IFX_FLASH_CBAB_STAT_VLD2_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD2 */
#define IFX_FLASH_CBAB_STAT_VLD2_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD2 */
#define IFX_FLASH_CBAB_STAT_VLD2_OFF (2u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD3 */
#define IFX_FLASH_CBAB_STAT_VLD3_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD3 */
#define IFX_FLASH_CBAB_STAT_VLD3_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD3 */
#define IFX_FLASH_CBAB_STAT_VLD3_OFF (3u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD4 */
#define IFX_FLASH_CBAB_STAT_VLD4_OFF (4u)

/** \brief  Length for Ifx_FLASH_CBAB_STAT_Bits.VLD5 */
#define IFX_FLASH_CBAB_STAT_VLD5_LEN (1u)

/** \brief  Mask for Ifx_FLASH_CBAB_STAT_Bits.VLD5 */
#define IFX_FLASH_CBAB_STAT_VLD5_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_CBAB_STAT_Bits.VLD5 */
#define IFX_FLASH_CBAB_STAT_VLD5_OFF (5u)

