leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISDBG */
#define IFX_FLASH_FPRO_PRODISDBG_OFF (9u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PRODISP */
#define IFX_FLASH_FPRO_PRODISP_OFF (1u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROIND */
#define IFX_FLASH_FPRO_PROIND_OFF (2u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROINDBG */
#define IFX_FLASH_FPRO_PROINDBG_OFF (8u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROINHSM */
#define IFX_FLASH_FPRO_PROINHSM_OFF (10u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROINHSMCOTP */
#define IFX_FLASH_FPRO_PROINHSMCOTP_OFF (4u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROINOTP */
#define IFX_FLASH_FPRO_PROINOTP_OFF (6u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.PROINP */
#define IFX_FLASH_FPRO_PROINP_OFF (0u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.RES5 */
#define IFX_FLASH_FPRO_RES5_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.RES5 */
#define IFX_FLASH_FPRO_RES5_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.RES5 */
#define IFX_FLASH_FPRO_RES5_OFF (5u)

/** \brief  Length for Ifx_FLASH_FPRO_Bits.RES7 */
#define IFX_FLASH_FPRO_RES7_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FPRO_Bits.RES7 */
#define IFX_FLASH_FPRO_RES7_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FPRO_Bits.RES7 */
#define IFX_FLASH_FPRO_RES7_OFF (7u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.D0BUSY */
#define IFX_FLASH_FSR_D0BUSY_OFF (1u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.DFDBER */
#define IFX_FLASH_FSR_DFDBER_OFF (19u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.DFMBER */
#define IFX_FLASH_FSR_DFMBER_OFF (21u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.DFPAGE */
#define IFX_FLASH_FSR_DFPAGE_OFF (10u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.DFSBER */
#define IFX_FLASH_FSR_DFSBER_OFF (18u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.DFTBER */
#define IFX_FLASH_FSR_DFTBER_OFF (20u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.ERASE */
#define IFX_FLASH_FSR_ERASE_OFF (8u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.EVER */
#define IFX_FLASH_FSR_EVER_OFF (26u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.FABUSY */
#define IFX_FLASH_FSR_FABUSY_OFF (0u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.OPER */
#define IFX_FLASH_FSR_OPER_OFF (11u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_FSR_Bits.ORIER */
#define IFX_FLASH_FSR_ORIER_OFF (30u)

/** \brief  Length for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_FSR_Bits.P0BUSY */
#define IFX_FLASH_FSR_P0BUSY_MSK (0x1u)

