leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.DFPAGE */
#define IFX_FLASH_HSMFSR_DFPAGE_OFF (10u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.ERASE */
#define IFX_FLASH_HSMFSR_ERASE_OFF (8u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.EVER */
#define IFX_FLASH_HSMFSR_EVER_OFF (26u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.OPER */
#define IFX_FLASH_HSMFSR_OPER_OFF (11u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.PROG */
#define IFX_FLASH_HSMFSR_PROG_OFF (7u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.PVER */
#define IFX_FLASH_HSMFSR_PVER_OFF (25u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.SPND */
#define IFX_FLASH_HSMFSR_SPND_OFF (27u)

/** \brief  Length for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMFSR_Bits.SQER */
#define IFX_FLASH_HSMFSR_SQER_OFF (12u)

/** \brief  Length for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMMARD_Bits.SELD1 */
#define IFX_FLASH_HSMMARD_SELD1_OFF (1u)

/** \brief  Length for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPND */
#define IFX_FLASH_HSMMARD_SPND_OFF (3u)

/** \brief  Length for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMMARD_Bits.SPNDERR */
#define IFX_FLASH_HSMMARD_SPNDERR_OFF (4u)

/** \brief  Length for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_LEN (29u)

/** \brief  Mask for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_FLASH_HSMRRAD_Bits.ADD */
#define IFX_FLASH_HSMRRAD_ADD_OFF (3u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.BUSY */
#define IFX_FLASH_HSMRRCT_BUSY_OFF (2u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_LEN (16u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_MSK (0xffffu)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.CNT */
#define IFX_FLASH_HSMRRCT_CNT_OFF (16u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.DONE */
#define IFX_FLASH_HSMRRCT_DONE_OFF (3u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.EOBM */
#define IFX_FLASH_HSMRRCT_EOBM_OFF (8u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.ERR */
#define IFX_FLASH_HSMRRCT_ERR_OFF (4u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STP */
#define IFX_FLASH_HSMRRCT_STP_OFF (1u)

/** \brief  Length for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_LEN (1u)

/** \brief  Mask for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_HSMRRCT_Bits.STRT */
#define IFX_FLASH_HSMRRCT_STRT_OFF (0u)

/** \brief  Length for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_LEN (32u)

/** \brief  Mask for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_FLASH_HSMRRD0_Bits.DATA */
#define IFX_FLASH_HSMRRD0_DATA_OFF (0u)

/** \brief  Length for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_LEN (32u)

/** \brief  Mask for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_FLASH_HSMRRD1_Bits.DATA */
#define IFX_FLASH_HSMRRD1_DATA_OFF (0u)

/** \brief  Length for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_LEN (16u)

/** \brief  Mask for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_MSK (0xffffu)

/** \brief  Offset for Ifx_FLASH_ID_Bits.MODNUMBER */
#define IFX_FLASH_ID_MODNUMBER_OFF (16u)

/** \brief  Length for Ifx_FLASH_ID_Bits.MODREV */
#define IFX_FLASH_ID_MODREV_LEN (8u)

/** \brief  Mask for Ifx_FLASH_ID_Bits.MODREV */
#define IFX_FLASH_ID_MODREV_MSK (0xffu)

