leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Offset for Ifx_FLASH_ID_Bits.MODREV */
#define IFX_FLASH_ID_MODREV_OFF (0u)

/** \brief  Length for Ifx_FLASH_ID_Bits.MODTYPE */
#define IFX_FLASH_ID_MODTYPE_LEN (8u)

/** \brief  Mask for Ifx_FLASH_ID_Bits.MODTYPE */
#define IFX_FLASH_ID_MODTYPE_MSK (0xffu)

/** \brief  Offset for Ifx_FLASH_ID_Bits.MODTYPE */
#define IFX_FLASH_ID_MODTYPE_OFF (8u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.HMARGIN */
#define IFX_FLASH_MARD_HMARGIN_OFF (0u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SELD0 */
#define IFX_FLASH_MARD_SELD0_OFF (1u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SPND */
#define IFX_FLASH_MARD_SPND_OFF (3u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.SPNDERR */
#define IFX_FLASH_MARD_SPNDERR_OFF (4u)

/** \brief  Length for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARD_Bits.TRAPDIS */
#define IFX_FLASH_MARD_TRAPDIS_OFF (15u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.RES1 */
#define IFX_FLASH_MARP_RES1_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.RES1 */
#define IFX_FLASH_MARP_RES1_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.RES1 */
#define IFX_FLASH_MARP_RES1_OFF (1u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.RES2 */
#define IFX_FLASH_MARP_RES2_OFF (2u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.RES3 */
#define IFX_FLASH_MARP_RES3_OFF (3u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.SELP0 */
#define IFX_FLASH_MARP_SELP0_OFF (0u)

/** \brief  Length for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_MARP_Bits.TRAPDIS */
#define IFX_FLASH_MARP_TRAPDIS_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_LEN (12u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_MSK (0xfffu)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.ESR0CNT */
#define IFX_FLASH_PROCOND_ESR0CNT_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.L */
#define IFX_FLASH_PROCOND_L_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.NSAFECC */
#define IFX_FLASH_PROCOND_NSAFECC_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RAMIN */
#define IFX_FLASH_PROCOND_RAMIN_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_LEN (4u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_MSK (0xfu)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RAMINSEL */
#define IFX_FLASH_PROCOND_RAMINSEL_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES10 */
#define IFX_FLASH_PROCOND_RES10_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES10 */
#define IFX_FLASH_PROCOND_RES10_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES10 */
#define IFX_FLASH_PROCOND_RES10_OFF (10u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES11 */
#define IFX_FLASH_PROCOND_RES11_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES11 */
#define IFX_FLASH_PROCOND_RES11_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES11 */
#define IFX_FLASH_PROCOND_RES11_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES12 */
#define IFX_FLASH_PROCOND_RES12_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES12 */
#define IFX_FLASH_PROCOND_RES12_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES12 */
#define IFX_FLASH_PROCOND_RES12_OFF (12u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES13 */
#define IFX_FLASH_PROCOND_RES13_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES13 */
#define IFX_FLASH_PROCOND_RES13_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES13 */
#define IFX_FLASH_PROCOND_RES13_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES14 */
#define IFX_FLASH_PROCOND_RES14_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES14 */
#define IFX_FLASH_PROCOND_RES14_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES14 */
#define IFX_FLASH_PROCOND_RES14_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES15 */
#define IFX_FLASH_PROCOND_RES15_LEN (1u)

