leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES15 */
#define IFX_FLASH_PROCOND_RES15_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES15 */
#define IFX_FLASH_PROCOND_RES15_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES29 */
#define IFX_FLASH_PROCOND_RES29_OFF (28u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES30 */
#define IFX_FLASH_PROCOND_RES30_OFF (30u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES8 */
#define IFX_FLASH_PROCOND_RES8_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES8 */
#define IFX_FLASH_PROCOND_RES8_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES8 */
#define IFX_FLASH_PROCOND_RES8_OFF (8u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RES9 */
#define IFX_FLASH_PROCOND_RES9_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RES9 */
#define IFX_FLASH_PROCOND_RES9_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RES9 */
#define IFX_FLASH_PROCOND_RES9_OFF (9u)

/** \brief  Length for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCOND_Bits.RPRO */
#define IFX_FLASH_PROCOND_RPRO_OFF (31u)

/** \brief  Length for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONDBG_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONDBG_DBGIFLCK_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONDBG_Bits.EDM */
#define IFX_FLASH_PROCONDBG_EDM_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONDBG_Bits.EDM */
#define IFX_FLASH_PROCONDBG_EDM_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONDBG_Bits.EDM */
#define IFX_FLASH_PROCONDBG_EDM_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCONDBG_Bits.OCDSDIS */
#define IFX_FLASH_PROCONDBG_OCDSDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONDBG_Bits.OCDSDIS */
#define IFX_FLASH_PROCONDBG_OCDSDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONDBG_Bits.OCDSDIS */
#define IFX_FLASH_PROCONDBG_OCDSDIS_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCONHSM_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONHSM_DBGIFLCK_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSM_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONHSM_DBGIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSM_Bits.DBGIFLCK */
#define IFX_FLASH_PROCONHSM_DBGIFLCK_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_FLASH_PROCONHSM_HSMDBGDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_FLASH_PROCONHSM_HSMDBGDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSM_Bits.HSMDBGDIS */
#define IFX_FLASH_PROCONHSM_HSMDBGDIS_OFF (0u)

/** \brief  Length for Ifx_FLASH_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_FLASH_PROCONHSM_HSMTSTDIS_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_FLASH_PROCONHSM_HSMTSTDIS_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSM_Bits.HSMTSTDIS */
#define IFX_FLASH_PROCONHSM_HSMTSTDIS_OFF (3u)

/** \brief  Length for Ifx_FLASH_PROCONHSM_Bits.RES15 */
#define IFX_FLASH_PROCONHSM_RES15_LEN (12u)

/** \brief  Mask for Ifx_FLASH_PROCONHSM_Bits.RES15 */
#define IFX_FLASH_PROCONHSM_RES15_MSK (0xfffu)

/** \brief  Offset for Ifx_FLASH_PROCONHSM_Bits.RES15 */
#define IFX_FLASH_PROCONHSM_RES15_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCONHSM_Bits.TSTIFLCK */
#define IFX_FLASH_PROCONHSM_TSTIFLCK_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSM_Bits.TSTIFLCK */
#define IFX_FLASH_PROCONHSM_TSTIFLCK_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSM_Bits.TSTIFLCK */
#define IFX_FLASH_PROCONHSM_TSTIFLCK_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.BLKFLAN */
#define IFX_FLASH_PROCONHSMCOTP_BLKFLAN_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.BLKFLAN */
#define IFX_FLASH_PROCONHSMCOTP_BLKFLAN_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.BLKFLAN */
#define IFX_FLASH_PROCONHSMCOTP_BLKFLAN_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.BOOTSEL */
#define IFX_FLASH_PROCONHSMCOTP_BOOTSEL_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.BOOTSEL */
#define IFX_FLASH_PROCONHSMCOTP_BOOTSEL_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.BOOTSEL */
#define IFX_FLASH_PROCONHSMCOTP_BOOTSEL_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.DESTDBG */
#define IFX_FLASH_PROCONHSMCOTP_DESTDBG_LEN (2u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.DESTDBG */
#define IFX_FLASH_PROCONHSMCOTP_DESTDBG_MSK (0x3u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.DESTDBG */
#define IFX_FLASH_PROCONHSMCOTP_DESTDBG_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM16X */
#define IFX_FLASH_PROCONHSMCOTP_HSM16X_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM16X */
#define IFX_FLASH_PROCONHSMCOTP_HSM16X_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM16X */
#define IFX_FLASH_PROCONHSMCOTP_HSM16X_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM17X */
#define IFX_FLASH_PROCONHSMCOTP_HSM17X_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM17X */
#define IFX_FLASH_PROCONHSMCOTP_HSM17X_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM17X */
#define IFX_FLASH_PROCONHSMCOTP_HSM17X_OFF (5u)

/** \brief  Length for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM6X */
#define IFX_FLASH_PROCONHSMCOTP_HSM6X_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONHSMCOTP_Bits.HSM6X */
#define IFX_FLASH_PROCONHSMCOTP_HSM6X_MSK (0x1u)

