leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S19ROM */
#define IFX_FLASH_PROCONOTP_S19ROM_OFF (19u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S1ROM */
#define IFX_FLASH_PROCONOTP_S1ROM_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S20ROM */
#define IFX_FLASH_PROCONOTP_S20ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S20ROM */
#define IFX_FLASH_PROCONOTP_S20ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S20ROM */
#define IFX_FLASH_PROCONOTP_S20ROM_OFF (20u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S21ROM */
#define IFX_FLASH_PROCONOTP_S21ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S21ROM */
#define IFX_FLASH_PROCONOTP_S21ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S21ROM */
#define IFX_FLASH_PROCONOTP_S21ROM_OFF (21u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S22ROM */
#define IFX_FLASH_PROCONOTP_S22ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S22ROM */
#define IFX_FLASH_PROCONOTP_S22ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S22ROM */
#define IFX_FLASH_PROCONOTP_S22ROM_OFF (22u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S23ROM */
#define IFX_FLASH_PROCONOTP_S23ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S23ROM */
#define IFX_FLASH_PROCONOTP_S23ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S23ROM */
#define IFX_FLASH_PROCONOTP_S23ROM_OFF (23u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S24ROM */
#define IFX_FLASH_PROCONOTP_S24ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S24ROM */
#define IFX_FLASH_PROCONOTP_S24ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S24ROM */
#define IFX_FLASH_PROCONOTP_S24ROM_OFF (24u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S25ROM */
#define IFX_FLASH_PROCONOTP_S25ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S25ROM */
#define IFX_FLASH_PROCONOTP_S25ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S25ROM */
#define IFX_FLASH_PROCONOTP_S25ROM_OFF (25u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S26ROM */
#define IFX_FLASH_PROCONOTP_S26ROM_OFF (26u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S2ROM */
#define IFX_FLASH_PROCONOTP_S2ROM_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S3ROM */
#define IFX_FLASH_PROCONOTP_S3ROM_OFF (3u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S4ROM */
#define IFX_FLASH_PROCONOTP_S4ROM_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S5ROM */
#define IFX_FLASH_PROCONOTP_S5ROM_OFF (5u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S6ROM */
#define IFX_FLASH_PROCONOTP_S6ROM_OFF (6u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S7ROM */
#define IFX_FLASH_PROCONOTP_S7ROM_OFF (7u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S8ROM */
#define IFX_FLASH_PROCONOTP_S8ROM_OFF (8u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.S9ROM */
#define IFX_FLASH_PROCONOTP_S9ROM_OFF (9u)

/** \brief  Length for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONOTP_Bits.TP */
#define IFX_FLASH_PROCONOTP_TP_OFF (31u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.RPRO */
#define IFX_FLASH_PROCONP_RPRO_OFF (31u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S0L */
#define IFX_FLASH_PROCONP_S0L_OFF (0u)

