leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S10L */
#define IFX_FLASH_PROCONP_S10L_OFF (10u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S11L */
#define IFX_FLASH_PROCONP_S11L_OFF (11u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S12L */
#define IFX_FLASH_PROCONP_S12L_OFF (12u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S13L */
#define IFX_FLASH_PROCONP_S13L_OFF (13u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S14L */
#define IFX_FLASH_PROCONP_S14L_OFF (14u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S15L */
#define IFX_FLASH_PROCONP_S15L_OFF (15u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S16L */
#define IFX_FLASH_PROCONP_S16L_OFF (16u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S17L */
#define IFX_FLASH_PROCONP_S17L_OFF (17u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S18L */
#define IFX_FLASH_PROCONP_S18L_OFF (18u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S19L */
#define IFX_FLASH_PROCONP_S19L_OFF (19u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S1L */
#define IFX_FLASH_PROCONP_S1L_OFF (1u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S20L */
#define IFX_FLASH_PROCONP_S20L_OFF (20u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S21L */
#define IFX_FLASH_PROCONP_S21L_OFF (21u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S22L */
#define IFX_FLASH_PROCONP_S22L_OFF (22u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S23L */
#define IFX_FLASH_PROCONP_S23L_OFF (23u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S24L */
#define IFX_FLASH_PROCONP_S24L_OFF (24u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S25L */
#define IFX_FLASH_PROCONP_S25L_OFF (25u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S26L */
#define IFX_FLASH_PROCONP_S26L_OFF (26u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S2L */
#define IFX_FLASH_PROCONP_S2L_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S3L */
#define IFX_FLASH_PROCONP_S3L_OFF (3u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S4L */
#define IFX_FLASH_PROCONP_S4L_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S5L */
#define IFX_FLASH_PROCONP_S5L_OFF (5u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S6L */
#define IFX_FLASH_PROCONP_S6L_OFF (6u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONP_Bits.S7L */
#define IFX_FLASH_PROCONP_S7L_OFF (7u)

/** \brief  Length for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONP_Bits.S8L */
#define IFX_FLASH_PROCONP_S8L_MSK (0x1u)

