leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxFlash_bf.h
/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S26WOP */
#define IFX_FLASH_PROCONWOP_S26WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S26WOP */
#define IFX_FLASH_PROCONWOP_S26WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S26WOP */
#define IFX_FLASH_PROCONWOP_S26WOP_OFF (26u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S2WOP */
#define IFX_FLASH_PROCONWOP_S2WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S2WOP */
#define IFX_FLASH_PROCONWOP_S2WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S2WOP */
#define IFX_FLASH_PROCONWOP_S2WOP_OFF (2u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S3WOP */
#define IFX_FLASH_PROCONWOP_S3WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S3WOP */
#define IFX_FLASH_PROCONWOP_S3WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S3WOP */
#define IFX_FLASH_PROCONWOP_S3WOP_OFF (3u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S4WOP */
#define IFX_FLASH_PROCONWOP_S4WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S4WOP */
#define IFX_FLASH_PROCONWOP_S4WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S4WOP */
#define IFX_FLASH_PROCONWOP_S4WOP_OFF (4u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S5WOP */
#define IFX_FLASH_PROCONWOP_S5WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S5WOP */
#define IFX_FLASH_PROCONWOP_S5WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S5WOP */
#define IFX_FLASH_PROCONWOP_S5WOP_OFF (5u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S6WOP */
#define IFX_FLASH_PROCONWOP_S6WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S6WOP */
#define IFX_FLASH_PROCONWOP_S6WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S6WOP */
#define IFX_FLASH_PROCONWOP_S6WOP_OFF (6u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S7WOP */
#define IFX_FLASH_PROCONWOP_S7WOP_OFF (7u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S8WOP */
#define IFX_FLASH_PROCONWOP_S8WOP_OFF (8u)

/** \brief  Length for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_PROCONWOP_Bits.S9WOP */
#define IFX_FLASH_PROCONWOP_S9WOP_OFF (9u)

/** \brief  Length for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_LEN (6u)

/** \brief  Mask for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_RDB_CFG0_Bits.TAG */
#define IFX_FLASH_RDB_CFG0_TAG_OFF (0u)

/** \brief  Length for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_LEN (6u)

/** \brief  Mask for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_RDB_CFG1_Bits.TAG */
#define IFX_FLASH_RDB_CFG1_TAG_OFF (0u)

/** \brief  Length for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_LEN (6u)

/** \brief  Mask for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_MSK (0x3fu)

/** \brief  Offset for Ifx_FLASH_RDB_CFG2_Bits.TAG */
#define IFX_FLASH_RDB_CFG2_TAG_OFF (0u)

/** \brief  Length for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_LEN (29u)

/** \brief  Mask for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_MSK (0x1fffffffu)

/** \brief  Offset for Ifx_FLASH_RRAD_Bits.ADD */
#define IFX_FLASH_RRAD_ADD_OFF (3u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.BUSY */
#define IFX_FLASH_RRCT_BUSY_OFF (2u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_LEN (16u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_MSK (0xffffu)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.CNT */
#define IFX_FLASH_RRCT_CNT_OFF (16u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.DONE */
#define IFX_FLASH_RRCT_DONE_OFF (3u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.EOBM */
#define IFX_FLASH_RRCT_EOBM_OFF (8u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.ERR */
#define IFX_FLASH_RRCT_ERR_OFF (4u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.STP */
#define IFX_FLASH_RRCT_STP_OFF (1u)

/** \brief  Length for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_LEN (1u)

/** \brief  Mask for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_MSK (0x1u)

/** \brief  Offset for Ifx_FLASH_RRCT_Bits.STRT */
#define IFX_FLASH_RRCT_STRT_OFF (0u)

/** \brief  Length for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_LEN (32u)

/** \brief  Mask for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_MSK (0xffffffffu)

/** \brief  Offset for Ifx_FLASH_RRD0_Bits.DATA */
#define IFX_FLASH_RRD0_DATA_OFF (0u)

/** \brief  Length for Ifx_FLASH_RRD1_Bits.DATA */
#define IFX_FLASH_RRD1_DATA_LEN (32u)

